stow/.config/doom/config.el
;;; -*- lexical-binding: t; -*-

(use-package just-mode
  :defer t
  :mode ("justfile\\'" . just-mode)
  :custom
  (just-indent-offset 4))

(use-package kdl-mode
  :defer t
  :mode ("\\.kdl\\'" . kdl-mode))

(use-package lsp-mode
  :defer t
  :custom
  (lsp-inlay-hint-enable t)
  (lsp-eldoc-render-all t)
  (lsp-rust-analyzer-display-chaining-hints t)
  (lsp-rust-analyzer-display-closure-return-type-hints t)
  (lsp-rust-analyzer-display-parameter-hints t)
  :config
  (lsp-register-custom-settings
   ;; Enable inlay hints in Go
   '(("gopls.hints" ((assignVariableTypes . t)
                     (compositeLiteralFields . t)
                     (compositeLiteralTypes . t)
                     (constantValues . t)
                     (functionTypeParameters . t)
                     (parameterNames . t)
                     (rangeVariableTypes . t)))))

  (lsp-register-client
   ;; Fish-LSP
   (make-lsp-client
    :new-connection (lsp-stdio-connection '("fish-lsp" "start"))
    :activation-fn (lsp-activate-on "fish")
    :server-id 'fish-lsp))
  (add-to-list 'lsp-language-id-configuration '(fish-mode . "fish"))
  (setopt lsp-semantic-tokens-enable t
          lsp-log-io nil))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :bind (:map lsp-ui-doc-mode-map
              ("M-k" . lsp-ui-doc-glance))
  :config
  (setopt lsp-ui-sideline-show-diagnostics nil))

(use-package flycheck
  :defer t
  :config
  (flycheck-posframe-configure-pretty-defaults)
  (setopt flycheck-posframe-mode t))

(use-package powershell
  :mode ("\\.ps1\\'" . powershell-mode)
  :hook (powershell-mode . lsp-mode)
  :config
  (setopt powershell-location-of-exe "/mnt/c/Program Files/Powershell/7/pwsh.exe")
  (setopt lsp-pwsh-exe "/mnt/c/Program Files/Powershell/7/pwsh.exe"))

(use-package lsp-pyright
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp)))
  :custom (lsp-pyright-langserver-command "basedpyright"))

(use-package uv :defer t)

(use-package dirvish
  :defer t
  :custom
  (dirvish-attributes '(nerd-icons collapse file-size file-time))
  (dirvish-default-layout '(0 0.11 0.55))
  (dirvish-time-format-string "%d-%m-%y %I:%S:%p %Z")
  (dired-use-ls-dired 't)
  (dirvish-peek-mode 't)
  :config
  (when (and (eq system-type 'darwin) (executable-find "gls"))
    (setopt insert-directory-program "gls")))

(map! :leader "e" #'dirvish)

(defun Ex ()
  "Literally just opens dirvish. Made because I keep doing `:Ex`."
  (interactive)
  (dirvish))

(setopt doom-font-increment 1)
(setopt doom-theme 'kaolin-bubblegum)
(setopt doom-font (font-spec :family "IosevkaTerm Nerd Font Mono" :size 18 :weight 'regular))

(use-package modus-themes
  :custom
  (modus-themes-italic-constructs t)
  (modus-themes-bold-constructs t)
  (modus-themes-headings
   '((1 . (1.25))
     (2 . (1.15))
     (3 . (1.12))
     (t . (1.05)))))

(use-package ef-themes)

(use-package kaolin-themes
  :custom
  (kaolin-themes-italic-comments t)
  (kaolin-themes-modeline-padded t))

(use-package buffer-to-pdf
  :defer t
  :ensure nil
  :config
  (setq buffer-to-pdf-directory (expand-file-name "~/")))

(add-hook 'eshell-mode-hook (lambda () (setenv "TERM" "xterm-256color")))

(require 'flash-isearch)
(require 'flash-evil)

(use-package flash
  :defer t
  :commands (flash-jump flash-treesitter)
  :init
  (flash-isearch-mode 1)
  :custom
  (flash-rainbow t)
  (flash-char-multi-line t)
  (flash-char-jump-labels t)
  (flash-labels ";asdfjklghqwertyuiopzxcvbnm"))

(with-eval-after-load 'evil
  (evil-global-set-key 'normal (kbd "s") #'flash-evil-jump)
  (evil-global-set-key 'operator (kbd "s") #'flash-evil-jump)
  (evil-global-set-key 'motion (kbd "s") #'flash-evil-jump)
  (evil-global-set-key 'visual (kbd "s") #'flash-evil-jump))

(use-package indent-bars
  :defer t
  :custom
  (indent-bars-pattern ".")
  (indent-bars-width-frac 0.5)
  (indent-bars-pad-frac 0.25)
  (indent-bars-color-by-depth nil))

(setopt user-full-name "Elian Manzueta")
(setopt user-mail-address "elianmanzueta@protonmail.com")

(setopt confirm-kill-emacs nil
        auto-save-default t
        make-backup-files t
        auto-save-default t
        truncate-string-ellipsis "…"
        delete-by-moving-to-trash t
        kill-ring-max 200

        evil-want-fine-undo t
        evil-shift-width 2
        evil-want-C-i-jump t

        +evil-want-move-window-to-wrap-around t
        display-line-numbers-type 'relative
        which-key-idle-delay 0.5
        which-key-idle-secondary-delay 0.05
        projectile-project-search-path '(("~/projects/" . 3))
        magit-show-long-lines-warning nil
        +whitespace-guess-in-projects t)

(add-to-list 'exec-path "/home/elian/.local/bin/")
(map! :leader "y" #'consult-yank-from-kill-ring)

;; For .service files
(add-to-list 'auto-mode-alist '("\\.service\\'" . conf-mode))

(map! :leader "wa" #'ace-select-window)

(add-hook 'text-mode-hook #'auto-fill-mode)
(setq-default fill-column 80)

(use-package ispell
  :custom
  (ispell-dictionary "english")
  (ispell-personal-dictionary "~/.config/doom/dict/.pws"))

(with-eval-after-load 'spell-fu
  (add-hook 'ansible-mode-hook (lambda () (spell-fu-mode -1)))
  (add-hook 'yaml-mode-hook (lambda () (spell-fu-mode -1)))
  (add-hook 'yaml-ts-mode-hook (lambda () (spell-fu-mode -1)))
  (add-hook 'json-mode-hook (lambda () (spell-fu-mode -1)))
  (add-hook 'prog-mode-hook (lambda () (spell-fu-mode -1))))

(setopt doom-scratch-initial-major-mode 'lisp-interaction-mode)
(setopt initial-scratch-message ";;; scratch-buffer -*- lexical-binding: t; -*-\n")

(setopt +dashboard-pwd-policy "~/")

(setopt evil-split-window-below t
        evil-vsplit-window-right t)

(use-package git-auto-commit-mode
  :defer t
  :custom
  (gac-automatically-push-p t)
  (gac-automatically-add-new-files-p t)
  (gac-debounce-interval 60)
  (gac-shell-and " ; and "))

(use-package org-agenda
  :after org
  :custom
  (org-agenda-timegrid-use-ampm t)
  (org-display-custom-times t)
  (org-time-stamp-custom-formats '("<%m/%d/%y %a>" . "<%m/%d/%y %a %I:%M %p>")))
