stow/.config/doom/config.org
*** ~org-super-agenda~
#+begin_src emacs-lisp :tangle yes
(use-package org-super-agenda
  :hook (org-agenda . org-super-agenda-mode)
  :config
  (setopt org-agenda-start-on-weekday 0)
  (setopt org-super-agenda-header-map (make-sparse-keymap))
  (setopt org-agenda-skip-scheduled-if-done t)
  (setopt org-agenda-skip-deadline-if-done t)
  (setopt org-agenda-overriding-header "")
  (setopt org-agenda-span 14)

  (setq org-super-agenda-groups
        '((:name ""
           :time-grid t)
          (:name "Inbox - Important"
           :and (:tag "inbox" :priority>= "B"))
          (:name "Inbox - In progress"
           :and (:tag "inbox" :todo "IN-PROGRESS"))
          (:name "Inbox"
           :and (:tag "inbox" :todo "TODO"))
          (:name "Projects"
           :ancestor-with-todo "PROJECT")
          (:name "Notes"
           :todo "NOTE")
          (:discard (:anything t)))))

(add-hook 'org-agenda-mode-hook 'org-super-agenda-mode)
#+end_src
** ~org-download~ and ~org-attach~
#+begin_src emacs-lisp :tangle yes
(use-package org-attach
  :after org
  :custom
  (org-attach-auto-tag nil)
  (org-attach-store-link-p 'file)
  (org-attach-id-to-path-function-list '(org-attach-id-ts-folder-format
                                         org-attach-id-uuid-folder-format
                                         org-attach-id-fallback-folder-format))
  (org-id-method 'ts)
  (org-id-ts-format "%Y-%m-%dT%H%M%S.%6N"))

(use-package org-download
  :after org
  :custom
  (org-download-image-org-width '450))
#+end_src
** ~org-mode~
#+begin_src emacs-lisp :tangle yes
(custom-set-faces!
  '(org-document-title :weight extra-bold :height 1.3)
  '(org-verbatim :inherit bold :weight extra-bold))

(use-package org
  :defer t
  :config
  (setopt org-hide-emphasis-markers t
          org-fontify-quote-and-verse-blocks t
          org-auto-align-tags nil
          org-tags-column 0
          org-agenda-tags-column 0
          org-startup-folded 'show2levels
          org-directory "~/org/"
          org-agenda-files '("~/org/roam/daily/" "~/org/roam/professional/" "~/org/inbox.org" "~/org/roam/life/")
          org-log-done 'time
          org-agenda-hide-tags-regexp "todo\\|work\\|workinfo\\|daily"
          org-safe-remote-resources '("\\`https://fniessen\\.github\\.io\\(?:/\\|\\'\\)")
          org-ellipsis " ▼")

  ;; Supresses warning I get with setopt
  (setq org-emphasis-alist '(("*" org-verbatim bold)
                             ("/" italic)
                             ("_" underline)
                             ("=" org-verbatim verbatim)
                             ("~" org-code verbatim)
                             ("+" (:strike-through t))))

  ;; Multi-line emphasis in org-mode
  (setcar (nthcdr 4 org-emphasis-regexp-components) 20)
  (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components))

(with-eval-after-load 'org
  (add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1)))

  ;; (add-to-list 'org-capture-templates
  ;;              '("m" "Meeting" entry
  ;;                (file+olp+datetree "~/org/roam/professional/meetings.org")
  ;;                "* ?\n** Topics\n** Notes"
  ;;                :prepend t))
  ;; (add-to-list 'org-capture-templates
  ;;              '("n" "Note" entry
  ;;                (file+olp+datetree "~/org/roam/professional/note.org")
  ;;                "* NOTE %?"
  ;;                :prepend t))
  )

;; org-yas-expand-maybe-h lags the absolute fuck out of Org.
;; disable it.
(with-eval-after-load 'evil-org
  (remove-hook 'org-tab-first-hook #'+org-yas-expand-maybe-h))
#+end_src
** ~org-repeat-by-cron~
#+begin_src emacs-lisp :tangle yes
(use-package org-repeat-by-cron)
#+end_src
** ~org-modern~
#+begin_src emacs-lisp :tangle yes
(use-package org-modern
  :after org
  :custom
  (org-modern-star 'replace)
  (org-modern-replace-stars "◉○✸✿")
  (org-modern-block-name '("‣ " . "‣ "))
  (org-modern-timestamp t)
  (org-modern-keyword "‣ ")
  (org-modern-table t)
  (org-modern-todo t))
#+end_src
** ~org-appear~
#+begin_src emacs-lisp :tangle yes
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autolinks t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-trigger 'on-change))
#+end_src
** ~org-roam~
#+begin_src emacs-lisp :tangle yes
(use-package org-roam
  :after org
  :custom
  (org-roam-node-default-sort 'file-mtime)
  (org-roam-file-exclude-regexp (list "~/org/.attach/"))

  (org-roam-capture-templates
   '(("d" "default" plain (file "~/org/roam/templates/default.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+author: %n\n#+date: %t\n")
      :unnarrowed t)
     ("s" "study" plain (file "~/org/roam/templates/study.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+author: %n\n#+date: %t\n#+filetags: study:%^{topics}")
      :unarrowed t)
     ("w" "work" plain (file "~/org/roam/templates/default.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+author: %n\n#+date: %t\n#+filetags: work")
      :unarrowed t)))

  (org-roam-dailies-capture-templates
   '(("w" "work-todo" plain (file "~/org/roam/templates/work-todo.org")
      :if-new (file+datetree "work-inbox.org" week)
      :unarrowed t))))

(use-package websocket :after org-roam)
(use-package org-roam-ui
  :after org-roam
  :custom
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t)
  (org-roam-ui-open-on-start t))

(defun my/org-roam-node-find-prof ()
  (interactive)
  (org-roam-node-find nil "@professional " nil))

(map! :leader "nrp" 'my/org-roam-node-find-prof)
#+end_src
** ~org-tidy~
#+begin_src emacs-lisp :tangle yes
(use-package org-tidy
  :after org
  :bind (:map org-mode-map
              ("C-c t" . org-tidy-mode))
  :custom
  (org-tidy-properties-style 'invisible))
#+end_src
** ~org-todo-keywords~
#+begin_src emacs-lisp :tangle yes
(with-eval-after-load 'org
  (setopt +org-capture-todo-file "inbox.org")

  (setopt org-todo-keywords
          '((sequence "TODO(t)" "PROJECT(p)" "IN-PROGRESS(i@/!)" "|" "DONE(d!)" "WONT-DO(w@/!)")
            (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)")
            (sequence "|" "OKAY(o)" "YES(y)" "NO(n)")
            (sequence "NOTE(N)" "HOLD(h)" "|")))

  (setopt org-todo-keyword-faces
          '(("[-]" . +org-todo-active) ("STRT" . +org-todo-active)
            ("[?]" . +org-todo-onhold) ("WAIT" . +org-todo-onhold)
            ("HOLD" . +org-todo-onhold) ("PROJ" . +org-todo-project)
            ("NO" . +org-todo-cancel) ("KILL" . +org-todo-cancel)
            ("NOTE" . flymake-note-echo)))

  (setopt org-modern-todo-faces
          '(("KILL" :inverse-video t :inherit +org-todo-cancel)
            ("NO" :inverse-video t :inherit +org-todo-cancel)
            ("PROJ" :inverse-video t :inherit +org-todo-project)
            ("HOLD" :inverse-video t :inherit +org-todo-onhold)
            ("WAIT" :inverse-video t :inherit +org-todo-onhold)
            ("[?]" :inverse-video t :inherit +org-todo-onhold)
            ("STRT" :inverse-video t :inherit +org-todo-active)
            ("NOTE" :inverse-video t :inherit flymake-note-echo)
            ("[-]" :inverse-video t :inherit +org-todo-active))))
#+end_src
* ~olivetti~
#+begin_src emacs-lisp :tangle yes
(use-package olivetti)
#+end_src
* Shells
** ~explicit-shell-file-name~
#+BEGIN_SRC emacs-lisp :tangle yes
;; (setopt explicit-shell-file-name
;;         (cond
;;          ((eq system-type 'darwin) "/opt/homebrew/bin/fish")
;;          ((eq system-type 'gnu/linux)
;;           (let ((cmd (shell-command-to-string "uname -a")))
;;             (if (string-match "NixOS" cmd)
;;                 "/run/current-system/sw/bin/fish"
;;               "/bin/fish")))
;;          (t "/bin/sh")))  ; Default to bourne shell for other systems

(use-package vterm
  :defer t
  :custom
  (vterm-shell explicit-shell-file-name)
  (vterm-buffer-name-string "vterm: %s"))
#+END_SRC
** ~emacs-libvterm~
Setting vterm path (if I have to compile manually).
#+begin_src emacs-lisp :tangle yes
(add-load-path! "~/emacs-libvterm")
#+end_src
** ~eat~
#+begin_src emacs-lisp :tangle no
(use-package eat
  :defer t
  :custom
  (process-adaptive-read-buffering nil) ; makes EAT a lot quicker!
  (eat-term-name "xterm-256color") ; https://codeberg.org/akib/emacs-eat/issues/119"
  (eat-shell "/bin/bash"))

(add-hook 'eshell-load-hook #'eat-eshell-mode)
(add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)
(add-hook 'eshell-mode-hook (lambda () (setenv "TERM" "xterm-256color")))
#+end_src
