stow/.config/doom/config.el

(use-package ghostel
  :defer t
  :custom
  (ghostel-enable-osc52 t)
  (ghostel-tramp-shell-integration t))

(use-package evil-ghostel
  :after (ghostel evil)
  :hook (ghostel-mode . evil-ghostel-mode))

(add-hook 'eshell-load-book #'ghostel-eshell-visual-command-mode)

(map! :leader "ot" #'ghostel)
(map! :leader "oT" #'ghostel-project)

(use-package ssh-config-mode
  :defer t
  :config
  (add-to-list 'auto-mode-alist '("/\\.ssh/config\\(\\.d/.*\\.conf\\)?\\'" . ssh-config-mode))
  (add-to-list 'auto-mode-alist '("/sshd?_config\\(\\.d/.*\\.conf\\)?\\'"  . ssh-config-mode))
  (add-to-list 'auto-mode-alist '("/known_hosts\\'"       . ssh-known-hosts-mode))
  (add-to-list 'auto-mode-alist '("/authorized_keys2?\\'" . ssh-authorized-keys-mode)))

(add-hook 'ssh-config-mode-hook 'turn-on-font-lock)

(use-package tramp-hlo
  :after tramp
  :custom
  (tramp-hlo-setup))

;; Most of this is from *Making TRAMP go Brrrr*
;; https://coredumped.dev/2025/06/18/making-tramp-go-brrrr./
(use-package tramp
  :defer t
  :init
  (with-eval-after-load 'tramp
    (with-eval-after-load 'compile
      (remove-hook 'compilation-mode-hook #'tramp-compile-disable-ssh-controlmaster-options)))

  (connection-local-set-profile-variables
   'remote-direct-async-process
   '((tramp-direct-async-process . t)))

  (connection-local-set-profiles
   '(:application tramp :protocol "scp")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "ssh")
   'remote-direct-async-process)

  (setopt magit-tramp-pipe-stty-settings 'pty)

  (setopt vc-ignore-dir-regexp
          (format "\\(%s\\)\\|\\(%s\\)"
                  vc-ignore-dir-regexp
                  tramp-file-name-regexp))
  (setopt enable-remote-dir-locals t))

(with-eval-after-load 'tramp
  (setenv "SHELL" "/bin/bash"))

(use-package verb
  :after org
  :init
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((verb . t)))
  :config (define-key org-mode-map (kbd "C-c C-r") verb-command-map))

(use-package vertico
  :defer t
  :custom
  (vertico-buffer-display-action '(display-buffer-reuse-window))

  (vertico-multiform-categories
   '((symbol (vertico-sort-function . vertico-sort-alpha))
     (file (vertico-sort-function . vertico-sort-history-alpha)))))

(use-package vertico-directory
  :after vertico
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package vertico-posframe-preview
  :after vertico
  :config
  (vertico-posframe-preview-mode 1))

(use-package undo-fu
  :custom
  (undo-limit 80000000))
